Revit 2026 API

# SpaceOutdoorAirflow Property

---

Get the Outdoor Airflow of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double OutdoorAirflow { get; }
```
```vb
Public ReadOnly Property OutdoorAirflow As Double
	Get
```
```cpp
public:
property double OutdoorAirflow {
	double get ();
}
```
```fsharp
member OutdoorAirflow : float with get
```

#### Property Value

Double

This property is used to get the Outdoor Airflow (Unit: ft3/s) of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace